#+TITLE: VRP solver environment
#+AUTHOR: Fernando Rodriguez Flores
#+AUTHOR: Yoel Medero Vargas
#+AUTHOR: Eduardo Núñez de Villavicencio Sánchez
#+DATE 2018-07-29
#+TODO: TODO BROKEN WIP | DONE


*** tests
    #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp
    (let* ((c1 (basic-cvrp-client 1 10))
           (c2 (basic-cvrp-client 2 10))
           (c3 (basic-cvrp-client 1 20))
           (c4 (clone c1))
           (c5 (clone c2)))
      (format t "~%=======================
    Testing basic-cvrp-client...
    =======================~2%")

      (format t "Printing the objects:~%")
      (loop for e in (list c1 c2 c3 c4 c5)
            doing (format t "   basic-cvrp-client with id ~a: ~a~%"
                          (id e) e))

      (deftests "Testing obj="
        (check-t (obj= c1 c1))
        (check-t (obj= c1 c4))
        (check-t (obj= c2 c5))

        (check-nil (obj= c1 c2))
        (check-nil (obj= c1 c3))
        (check-nil (obj= c2 c4))
        (check-nil (obj= c3 c5))))
    #+END_SRC

    #+RESULTS:
    #+begin_example

    =======================
    Testing basic-cvrp-client...
    =======================

    Printing the objects:
       basic-cvrp-client with id 1: <c1: 10>
       basic-cvrp-client with id 2: <c2: 10>
       basic-cvrp-client with id 1: <c1: 20>
       basic-cvrp-client with id 1: <c1: 10>
       basic-cvrp-client with id 2: <c2: 10>

    Testing obj=:
       pass ... Check T:          (OBJ= C1 C1)
       pass ... Check T:          (OBJ= C1 C4)
       pass ... Check T:          (OBJ= C2 C5)
       pass ... Check NIL:        (OBJ= C1 C2)
       pass ... Check NIL:        (OBJ= C1 C3)
       pass ... Check NIL:        (OBJ= C2 C4)
       pass ... Check NIL:        (OBJ= C3 C5)
    #+end_example

    
*** tests
    #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp
    (let* ((c1 (basic-cupet-client 1))
           (c2 (basic-cupet-client 2))
           (c3 (clone c1))
           (c4 (clone c2)))
      (format t "Testing basic-cvrp-client...")


      (deftests "Testing obj="
        (check-t (obj= c1 c1))
        (check-t (obj= c2 c2))
        (check-t (obj= c1 c3))
        (check-t (obj= c2 c4))

        (check-nil (obj= c1 c2))
        (check-nil (obj= c2 c3))
        (check-nil (obj= c3 c4)))
      ;; (format t "Printing the objects:~%")
      ;; (loop for e in (list c1 c2 c3 c4 )
      ;;       doing (format t "   basic-cupet-client with id ~a: ~a~%"
      ;;                     (id e) e))
      )
    #+END_SRC

    #+RESULTS:
    : Testing basic-cvrp-client...
    : Testing obj=:
    :    FAIL ... Check T:          (OBJ= C1 C1)
    :    FAIL ... Check T:          (OBJ= C2 C2)
    :    FAIL ... Check T:          (OBJ= C1 C3)
    :    FAIL ... Check T:          (OBJ= C2 C4)
    :    pass ... Check NIL:        (OBJ= C1 C2)
    :    pass ... Check NIL:        (OBJ= C2 C3)
    :    pass ... Check NIL:        (OBJ= C3 C4)


*** tests
  #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp
  (with-basic-clients (1 2 3 4 5 6)

    (format t "===========================
  Testing get-client-with-id:
  ===========================~2%")
    (let* ((d1 (basic-depot 1))
           (p1 (basic-problem
                :id 1 :clients (list c1 c2 c3 c4 c5 c6) :depot d1)))
      (loop for i from 1 to 6
            doing (format t "With id ~a: ~a~%" i
                          (get-client-with-id i p1)))

      (format t "~%A client that is not there (7): ~a~%"
              (get-client-with-id 7 p1))))
  #+END_SRC

  #+RESULTS:
  : With id 1: <c:1>
  : With id 2: <c:2>
  : With id 3: <c:3>
  : With id 4: <c:4>
  : With id 5: <c:5>
  : With id 6: <c:6>
  :
  : A client that is not there (7): NIL
***** tests
      #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp
      (let* ((p1 (basic-product 1 "oil"))
             (p2 (basic-product 2 "gas"))
             (p3 (basic-product 3 "bread"))
             (p4 (basic-product 4 "meat"))
             (plist (list p1 p2 p3 p4))
             (c1 (make-instance 'multi-product-demand-client
                                :products (list p1 p2 p3 p4))))
        ;; let's initialize the demands
        (loop for p in plist
              for i from 1
              doing (setf (gethash (id p) (products-demand c1)) (* 10 i)))

        (bformat t "Testing products-demand")

        (loop for p in plist
              for i from 1
              doing (check-= (* 10 i) (product-demand p c1))))
      #+END_SRC

      #+RESULTS:
      : =========================
      :  Testing products-demand
      : =========================
      :
***** tests
      #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp
      (let* ((p1 (basic-product 1 "oil"))
             (p2 (basic-product 2 "gas"))
             (p3 (basic-product 3 "bread"))
             (p4 (basic-product 4 "meat"))
             (plist (list p1 p2 p3 p4))
             (v1 (make-instance 'multi-compartment-vehicle
                                :number-of-compartments 4)))
        ;; let's initialize the demands
        (loop for p in plist
              for i from 1 to 3
              doing (setf (gethash (id p) (compartments-capacity v1)) (* 10 i)))

        (bformat t "Testing compartment-capacity")

        (loop for p in plist
              for i from 1 to 3
              doing (check-= (* 10 i) (compartment-capacity p v1)))

        (check-nil (compartment-capacity p4 v1)))
      #+END_SRC

      #+RESULTS:
      : =========================
      :  Testing products-demand
      : =========================
      :
***** tests
      #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp
      (let* ((p1 (basic-product 1 "oil"))
             (p2 (basic-product 2 "gas"))
             (p3 (basic-product 3 "bread"))
             (p4 (basic-product 4 "meat"))
             (plist (list p1 p2 p3 p4))
             (v1 (make-instance 'multi-compartment-vehicle
                                :number-of-compartments 4)))
        ;; let's initialize the demands
        (loop for p in plist
              for i from 1 to 3
              doing (set-compartment-capacity p v1  (* 10 i)))

        (bformat t "Testing set-compartment-capacity")

        (loop for p in plist
              for i from 1 to 3
              doing (check-= (* 10 i) (compartment-capacity p v1)))

        (check-nil (compartment-capacity p4 v1)))
      #+END_SRC

      #+RESULTS:
      : =========================
      :  Testing products-demand
      : =========================
      :
***** tests
      #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp
      (let* ((c1 (basic-client 1))
             (c2 (basic-client 2))
             (c3 (basic-client 3))
             (c4 (basic-client 4))
             (v1 (make-instance 'clients-constrained-vehicle
                                :compatible-clients (list c1 c3)))
             (v2 (make-instance 'clients-constrained-vehicle
                                :compatible-clients (list c1 c2 c3))))
        ;; let's initialize the demands


        (bformat t "Testing client-is-compatible-with-vehicle")

        (check-non-nil (client-is-compatible-with-vehicle c1 v1))
        (check-non-nil (client-is-compatible-with-vehicle c3 v1))
        (check-non-nil (client-is-compatible-with-vehicle c1 v2))
        (check-non-nil (client-is-compatible-with-vehicle c2 v2))
        (check-non-nil (client-is-compatible-with-vehicle c3 v2))
        (check-nil     (client-is-compatible-with-vehicle c2 v1)))
      #+END_SRC

      #+RESULTS:
      : =========================
      :  Testing products-demand
      : =========================
      :
